## Plan Result (user-list-search-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/225275)



<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_lambda_event_source_mapping.kinesis_consumer



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_event_source_mapping.kinesis_consumer will be created
  + resource "aws_lambda_event_source_mapping" "kinesis_consumer" {
      + batch_size                    = 10000
      + enabled                       = true
      + event_source_arn              = "arn:aws:kinesis:us-east-1:996905175585:stream/unified_event"
      + function_arn                  = (known after apply)
      + function_name                 = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UnifiedEventsConsumer:DEPLOYED"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = 60
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + starting_position             = "LATEST"
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"261202ea-de26-4ba0-b263-fbc17bd9e02c","JobName":"user-list-search_infrastructure_plan_prod","PRNumber":623,"Program":"tfcmt","SHA1":"1efe7668cc129339aa71c79df00d71c21ff224f5","Target":"user-list-search-cdk","Vars":{}} -->